In [1]:
import pandas as pd
import numpy as np

In [2]:
import warnings
warnings.filterwarnings('ignore')

# mathmatical functions()

In [3]:
data={
    "maths":[90,80,70],
    "science":[85,95,75],
    "english":[88,76,92]
}
df=pd.DataFrame(data)
df

   maths  science  english
0     90       85       88
1     80       95       76
2     70       75       92

In [7]:
#sum---->df.sum
print(df.sum()) #column wise
print("--"*20)
print(df.sum(axis=1))#row wise

maths      240
science    255
english    256
dtype: int64
----------------------------------------
0    263
1    251
2    237
dtype: int64

In [10]:
#mean-->df.mean()
print(df.mean())
print("----"*20)
print(df.mean(axis=1))

maths      80.000000
science    85.000000
english    85.333333
dtype: float64
--------------------------------------------------------------------------------
0    87.666667
1    83.666667
2    79.000000
dtype: float64

In [11]:
#median--->df.meadian()
print(df.median())

maths      80.0
science    85.0
english    88.0
dtype: float64

In [12]:
#man()---->df.max()
print(df.max())

maths      90
science    95
english    92
dtype: int64

In [13]:
#min()---->df.min()
print(df.min())

maths      70
science    75
english    76
dtype: int64

In [15]:
#varience--->df.var()
print(df.var())

maths      100.000000
science    100.000000
english     69.333333
dtype: float64

In [16]:
#standard variance()--->df.std()
print(df.std())

maths      10.000000
science    10.000000
english     8.326664
dtype: float64

In [17]:
#cumulative sum()
print(df.cumsum())

   maths  science  english
0     90       85       88
1    170      180      164
2    240      255      256

In [18]:
#cumulative product()
print(df.cumprod())

    maths  science  english
0      90       85       88
1    7200     8075     6688
2  504000   605625   615296

In [20]:
#absulute value--->turns negatuve values into positive values
print(df.abs())

   maths  science  english
0     90       85       88
1     80       95       76
2     70       75       92

In [22]:
#power
print(df.pow(2)) # return all square values

   maths  science  english
0   8100     7225     7744
1   6400     9025     5776
2   4900     5625     8464

In [23]:
#round()
print(df.round())

   maths  science  english
0     90       85       88
1     80       95       76
2     70       75       92

In [24]:
#count()-->print no.of  non -Na values in each column
print(df.count())

maths      3
science    3
english    3
dtype: int64

In [25]:
#product
print(df.prod())

maths      504000
science    605625
english    615296
dtype: int64

In [26]:
#correlation--->it telles us relationship b/w values
#value range-->-1 to+1
print(df.corr())

            maths   science   english
maths    1.000000  0.500000 -0.240192
science  0.500000  1.000000 -0.960769
english -0.240192 -0.960769  1.000000

In [27]:
#covarience
print(df.cov())

         maths  science    english
maths    100.0     50.0 -20.000000
science   50.0    100.0 -80.000000
english  -20.0    -80.0  69.333333

# getting column index/label

In [32]:
df=pd.DataFrame({
    "Name":["A","B","C"],
    "Age":[23,25,21],
    "City":["Delhi","Mumbai","Chennai"]
})
df

  Name  Age     City
0    A   23    Delhi
1    B   25   Mumbai
2    C   21  Chennai

In [33]:
df.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [34]:
print(df.columns[0])

Name

In [35]:
print(list(df.columns))

['Name', 'Age', 'City']

In [37]:
print(df.keys())

Index(['Name', 'Age', 'City'], dtype='object')

In [38]:
df["Name"]

0    A
1    B
2    C
Name: Name, dtype: object

In [42]:
print(df.index)
print(list(df.index))

RangeIndex(start=0, stop=3, step=1)
[0, 1, 2]

In [43]:
print(df.index[0])

0

In [46]:
df=pd.DataFrame({
    "Name":["A","B","C"],
    "Age":[23,25,21],
    "City":["Delhi","Mumbai","Chennai"]
},index=["emp1","emp2","emp3"])
df

     Name  Age     City
emp1    A   23    Delhi
emp2    B   25   Mumbai
emp3    C   21  Chennai

In [47]:
df.index

Index(['emp1', 'emp2', 'emp3'], dtype='object')

In [48]:
#rename columns label
df=pd.DataFrame({
    "Name":["A","B","C"],
    "Age":[23,25,21],
    "City":["Delhi","Mumbai","Chennai"]
})
df

  Name  Age     City
0    A   23    Delhi
1    B   25   Mumbai
2    C   21  Chennai

In [49]:
df1=df.rename(columns={"Name":"FullName","City":"Location"})
df1

  FullName  Age Location
0        A   23    Delhi
1        B   25   Mumbai
2        C   21  Chennai

In [55]:
df2=df.copy()
df2.columns=["FullName","Years","Location"]
df2

  FullName  Years Location
0        A     23    Delhi
1        B     25   Mumbai
2        C     21  Chennai

In [3]:
import pandas as pd
import numpy as np

In [4]:
df=pd.DataFrame({
    "Name":["A","B","C"],
    "Age":[23,25,21],
    "City":["Delhi","Mumbai","Chennai"]
})
df

  Name  Age     City
0    A   23    Delhi
1    B   25   Mumbai
2    C   21  Chennai

In [5]:
df2=df.copy()
df2.columns=["FullName","Years","Location"]
df2

  FullName  Years Location
0        A     23    Delhi
1        B     25   Mumbai
2        C     21  Chennai

In [13]:
df5.columns=[i.upper() for i in df5.columns]
df5

  FULLNAME  YEARS LOCATION
0        A     23    Delhi
1        B     25   Mumbai
2        C     21  Chennai

In [8]:
df3=df2.add_prefix("emp_")
df3

  emp_FULLNAME  emp_YEARS emp_LOCATION
0            A         23        Delhi
1            B         25       Mumbai
2            C         21      Chennai

In [10]:
df4=df2.add_suffix("_data")
df4

  FULLNAME_data  YEARS_data LOCATION_data
0             A          23         Delhi
1             B          25        Mumbai
2             C          21       Chennai

In [12]:
df5=df.set_axis(["FullName","Years","location"],axis=1)
df5

  FullName  Years location
0        A     23    Delhi
1        B     25   Mumbai
2        C     21  Chennai

In [17]:
df5.columns=df5.columns.str.upper()
df5

  FULLNAME  YEARS LOCATION
0        A     23    Delhi
1        B     25   Mumbai
2        C     21  Chennai

In [18]:
df5.columns=df5.columns.str.lower()
df5

  fullname  years location
0        A     23    Delhi
1        B     25   Mumbai
2        C     21  Chennai

## selecting and swaping columns()

In [19]:
df=pd.DataFrame({
    "Name":["A","B","C"],
    "Age":[23,25,21],
    "City":["Delhi","Mumbai","Chennai"]
})
df

  Name  Age     City
0    A   23    Delhi
1    B   25   Mumbai
2    C   21  Chennai

In [21]:
print(df["Name"])
print("--"*20)
print(df[["Name","City"]])
print("--"*20)
print(df.iloc[:,1])#first column
print("--"*20)
print(df.iloc[:,[0,2]])#first column and third column
print("--"*20)
print(df.iloc[:,0:2])#first two columns

0    A
1    B
2    C
Name: Name, dtype: object
----------------------------------------
  Name     City
0    A    Delhi
1    B   Mumbai
2    C  Chennai
----------------------------------------
0    23
1    25
2    21
Name: Age, dtype: int64
----------------------------------------
  Name     City
0    A    Delhi
1    B   Mumbai
2    C  Chennai
----------------------------------------
  Name  Age
0    A   23
1    B   25
2    C   21

## swaping-->rearrange the order

In [27]:
df1=df[["Name","City","Age"]]
print(df1)
print("--"*20)
#swap two columns(2nd method)
cols=list(df.columns)
cols[1],cols[2]=cols[2],cols[1]
df2=df[cols]
print(df2)
#3rd method-->reindex
df3=df.reindex(columns=["City","Name","Age"])
print(df3)
df4=df.iloc[:,[2,0,1]]
print(df4)

  Name     City  Age
0    A    Delhi   23
1    B   Mumbai   25
2    C  Chennai   21
----------------------------------------
  Name     City  Age
0    A    Delhi   23
1    B   Mumbai   25
2    C  Chennai   21
      City Name  Age
0    Delhi    A   23
1   Mumbai    B   25
2  Chennai    C   21
      City Name  Age
0    Delhi    A   23
1   Mumbai    B   25
2  Chennai    C   21

## adding new column

In [28]:
df=pd.DataFrame({
    "Name":["A","B","C"],
    "Age":[23,25,21],
    "City":["Delhi","Mumbai","Chennai"]
})
df

  Name  Age     City
0    A   23    Delhi
1    B   25   Mumbai
2    C   21  Chennai

In [30]:
#Add new column
df["country"]="india"
df

  Name  Age     City country
0    A   23    Delhi   india
1    B   25   Mumbai   india
2    C   21  Chennai   india

In [31]:
df["Marks"]=[85,90,94]
df

  Name  Age     City country  Marks
0    A   23    Delhi   india     85
1    B   25   Mumbai   india     90
2    C   21  Chennai   india     94

In [32]:
df["Age_after_5years"]=df["Age"]+5
df

  Name  Age     City country  Marks  Age_after_5years
0    A   23    Delhi   india     85                28
1    B   25   Mumbai   india     90                30
2    C   21  Chennai   india     94                26

In [33]:
df2=df.assign(Status=["pass","pass","pass"])
df2

  Name  Age     City country  Marks  Age_after_5years Status
0    A   23    Delhi   india     85                28   pass
1    B   25   Mumbai   india     90                30   pass
2    C   21  Chennai   india     94                26   pass

## droping existing column

In [47]:
df=pd.DataFrame({
    "Name":["A","B","C"],
    "Age":[23,25,21],
    "City":["Delhi","Mumbai","Chennai"],
    "Status":["pass","pass","pass"],
    "Marks":[85,90,94]
})
df

  Name  Age     City Status  Marks
0    A   23    Delhi   pass     85
1    B   25   Mumbai   pass     90
2    C   21  Chennai   pass     94

In [2]:
#inplace=true --->isthe function modifies the original data frame directly ,no need to reassign
#df3=df.drop("Marks",axis=1,inplace=True)
#df3

# Vectorised arthemetic operations in panda

In [4]:
import pandas as pd
import numpy as np

In [5]:
df=pd.DataFrame({
    "A":[10,20,30],
    "B":[1,2,3]
})
df

    A  B
0  10  1
1  20  2
2  30  3

In [6]:
df["A+B"]=df["A"]+df["B"]
df

    A  B  A+B
0  10  1   11
1  20  2   22
2  30  3   33

In [7]:
df["A-B"]=df["A"]-df["B"]
df

    A  B  A+B  A-B
0  10  1   11    9
1  20  2   22   18
2  30  3   33   27

In [8]:
df["A*B"]=df["A"]*df["B"]
df

    A  B  A+B  A-B  A*B
0  10  1   11    9   10
1  20  2   22   18   40
2  30  3   33   27   90

In [9]:
df["A/B"]=df["A"]/df["B"]
df

    A  B  A+B  A-B  A*B   A/B
0  10  1   11    9   10  10.0
1  20  2   22   18   40  10.0
2  30  3   33   27   90  10.0

In [10]:
df["A//B"]=df["A"]//df["B"]
df

    A  B  A+B  A-B  A*B   A/B  A//B
0  10  1   11    9   10  10.0    10
1  20  2   22   18   40  10.0    10
2  30  3   33   27   90  10.0    10

In [11]:
df["A%B"]=df["A"]%df["B"]
df

    A  B  A+B  A-B  A*B   A/B  A//B  A%B
0  10  1   11    9   10  10.0    10    0
1  20  2   22   18   40  10.0    10    0
2  30  3   33   27   90  10.0    10    0

In [12]:
df["A**B"]=df["A"]**df["B"]
df

    A  B  A+B  A-B  A*B   A/B  A//B  A%B   A**B
0  10  1   11    9   10  10.0    10    0     10
1  20  2   22   18   40  10.0    10    0    400
2  30  3   33   27   90  10.0    10    0  27000

In [14]:
df["A+5"]=df["A"]+5
df

    A  B  A+B  A-B  A*B   A/B  A//B  A%B   A**B  A+5
0  10  1   11    9   10  10.0    10    0     10   15
1  20  2   22   18   40  10.0    10    0    400   25
2  30  3   33   27   90  10.0    10    0  27000   35

In [15]:
df["A*5"]=df["B"]*5
df

    A  B  A+B  A-B  A*B   A/B  A//B  A%B   A**B  A+5  A*5
0  10  1   11    9   10  10.0    10    0     10   15    5
1  20  2   22   18   40  10.0    10    0    400   25   10
2  30  3   33   27   90  10.0    10    0  27000   35   15

In [16]:
df=pd.DataFrame({
    "Name":["A","B","C"],
    "Age":[23,25,21],
    "City":["Delhi","Mumbai","Chennai"]
})
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

# astype()